{"Body": "Hello everyone,\n\n\nThe first three tabs indicate any new provider additions, changes, or terminations occurring since the previous month's roster.\n\nThe remaining tabs are complete listings of providers rendering services under each of our delegated TIN's.\n\n\n\nMaryland Family Care, Inc.                      52-2046586\n\nSt. Paul Place Specialists, Inc.                    52-1495113\n\nVascular Specialty Services, Inc.                 52-1995474\n\nLutherville Hematology and Oncology Services   27-4697590\n\nTeresa Hoffman, MD & Associates            52-2154405\n\n                                                                                                Neurosurgical Specialty Services, LLC         47-3421551\n\n\n\nOur IT department as implemented the \"secure zip message\" there's an expiration date of 30 days, if an email is not open in a timely manner.\n\n\n\nPlease attempt / try to open the \"Monthly Delegated Roster\" within 30 days, so that I can be assured that our provider's are being loaded/credentialed in your systems as PAR.\n\n\n\nIf you have any questions, or if additional information is required, please feel free to call or email me.\n\nI would appreciate confirmation that you have received this roster, and again when all data has been updated.\n\n\nThanks,\n\nVickie Campbell\nManager, Medical Staff Services\n410-659-2802 phone\n410-332-9789 fax\n\n\n\nThis email transmission may contain CONFIDENTIAL, PRIVILEGED, and/or PROTECTED INFORMATION. It is intended solely for the use of the individual or entity to whom it is addressed. The transmission may contain information subject to federal and/or state privacy laws. If you are not the intended recipient, please notify the sender by email immediately, do not disseminate or copy the transmission, and delete it immediately.\n\n\nThis email transmission may contain CONFIDENTIAL, PRIVILEGED,   and or PROTECTED INFORMATION intended solely for the use of the individual or entity to whom they are addressed. If you are not the intended recipient, please notify the sender by email, do not disseminate or copy and delete immediately. \n\nThis message was secured by Zix(R).\n\n\n\n-----------------------------------------------------------------\nAttachments:        MMC -October 2017 - Maryland.xlsx\n                    ", "To": "                   \n            providerdata@cigna.comAngela.D.Speck@healthnet.com;delprovphycon_requests@uhc.com \n                     ", "From": "vcampbell@mdmercy.com", "Sent": "                      \t    \n            \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOct 30, 2017 \n            2:36:13 PM\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t   ", "Subject": "RE: Monthly Delegated \n            Roster -October 2017"}